{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "dtype": "float32", "trainable": true, "name": "conv2d_1", "activation": "relu", "padding": "valid", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 32, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "name": "conv2d_2", "activation": "relu", "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 64, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 128, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 0, "trainable": true}}], "keras_version": "2.0.6"}