{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 32, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "data_format": "channels_last", "filters": 64, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "units": 128, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "units": 10, "use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.6"}