{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 32, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "use_bias": true}}], "class_name": "Sequential", "keras_version": "2.0.6"}