{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "dilation_rate": [1, 1], "activation": "relu", "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 32}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "dilation_rate": [1, 1], "activation": "relu", "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}