{"config": [{"config": {"kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 32, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 128, "name": "dense_1", "activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 10, "name": "dense_2", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}